src/result/wrk_replicas.txt
GET

Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.927ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.870ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.946ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.864ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.46ms    1.79ms  37.18ms   97.69%
    Req/Sec     1.32k   184.33     4.11k    84.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.70ms
 90.000%    2.13ms
 99.000%    8.41ms
 99.900%   27.89ms
 99.990%   33.38ms
 99.999%   36.64ms
100.000%   37.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.086     0.000000            1         1.00
       0.502     0.100000         9998         1.11
       0.750     0.200000        20023         1.25
       0.932     0.300000        30043         1.43
       1.090     0.400000        40041         1.67
       1.241     0.500000        50041         2.00
       1.317     0.550000        55003         2.22
       1.399     0.600000        60030         2.50
       1.490     0.650000        65033         2.86
       1.588     0.700000        69999         3.33
       1.700     0.750000        74976         4.00
       1.759     0.775000        77496         4.44
       1.821     0.800000        79990         5.00
       1.888     0.825000        82508         5.71
       1.960     0.850000        84996         6.67
       2.041     0.875000        87477         8.00
       2.087     0.887500        88753         8.89
       2.135     0.900000        89978        10.00
       2.191     0.912500        91237        11.43
       2.251     0.925000        92508        13.33
       2.323     0.937500        93721        16.00
       2.369     0.943750        94355        17.78
       2.419     0.950000        94991        20.00
       2.485     0.956250        95604        22.86
       2.569     0.962500        96224        26.67
       2.707     0.968750        96845        32.00
       2.839     0.971875        97161        35.56
       3.045     0.975000        97468        40.00
       3.389     0.978125        97781        45.71
       3.931     0.981250        98094        53.33
       4.819     0.984375        98406        64.00
       5.467     0.985938        98563        71.11
       6.311     0.987500        98718        80.00
       7.351     0.989062        98874        91.43
       9.199     0.990625        99030       106.67
      11.151     0.992188        99187       128.00
      12.143     0.992969        99265       142.22
      13.039     0.993750        99343       160.00
      13.999     0.994531        99421       182.86
      15.007     0.995313        99499       213.33
      16.167     0.996094        99578       256.00
      16.783     0.996484        99616       284.44
      17.407     0.996875        99655       320.00
      18.175     0.997266        99695       365.71
      19.167     0.997656        99734       426.67
      20.879     0.998047        99772       512.00
      22.095     0.998242        99792       568.89
      23.727     0.998437        99811       640.00
      25.615     0.998633        99831       731.43
      26.959     0.998828        99850       853.33
      27.999     0.999023        99870      1024.00
      28.623     0.999121        99880      1137.78
      29.647     0.999219        99889      1280.00
      30.191     0.999316        99899      1462.86
      30.703     0.999414        99909      1706.67
      31.135     0.999512        99920      2048.00
      31.279     0.999561        99924      2275.56
      31.439     0.999609        99928      2560.00
      31.679     0.999658        99933      2925.71
      32.047     0.999707        99939      3413.33
      32.287     0.999756        99943      4096.00
      32.527     0.999780        99946      4551.11
      32.719     0.999805        99948      5120.00
      32.863     0.999829        99951      5851.43
      33.055     0.999854        99953      6826.67
      33.311     0.999878        99955      8192.00
      33.375     0.999890        99957      9102.22
      33.535     0.999902        99958     10240.00
      33.727     0.999915        99959     11702.86
      33.887     0.999927        99960     13653.33
      33.919     0.999939        99961     16384.00
      34.367     0.999945        99962     18204.44
      34.815     0.999951        99963     20480.00
      34.815     0.999957        99963     23405.71
      35.455     0.999963        99964     27306.67
      35.455     0.999969        99964     32768.00
      36.063     0.999973        99965     36408.89
      36.063     0.999976        99965     40960.00
      36.063     0.999979        99965     46811.43
      36.639     0.999982        99966     54613.33
      36.639     0.999985        99966     65536.00
      36.639     0.999986        99966     72817.78
      36.639     0.999988        99966     81920.00
      36.639     0.999989        99966     93622.86
      37.215     0.999991        99967    109226.67
      37.215     1.000000        99967          inf
#[Mean    =        1.460, StdDeviation   =        1.792]
#[Max     =       37.184, Total count    =        99967]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149991 requests in 30.00s, 9.87MB read
  Non-2xx or 3xx responses: 149991
Requests/sec:   5000.07
Transfer/sec:    336.92KB

----------------------------------------------------------------------------------------------------------------

PUT

Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.225ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.217ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.239ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms    0.89ms  20.30ms   90.04%
    Req/Sec     1.32k   149.33     3.67k    85.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.59ms
 90.000%    1.96ms
 99.000%    2.65ms
 99.900%   14.45ms
 99.990%   18.22ms
 99.999%   20.03ms
100.000%   20.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.135     0.000000            1         1.00
       0.506     0.100000        10008         1.11
       0.720     0.200000        19995         1.25
       0.901     0.300000        30035         1.43
       1.056     0.400000        40040         1.67
       1.200     0.500000        50051         2.00
       1.270     0.550000        55017         2.22
       1.340     0.600000        60004         2.50
       1.415     0.650000        65024         2.86
       1.497     0.700000        69977         3.33
       1.589     0.750000        75008         4.00
       1.638     0.775000        77499         4.44
       1.692     0.800000        80000         5.00
       1.750     0.825000        82492         5.71
       1.812     0.850000        85007         6.67
       1.880     0.875000        87500         8.00
       1.919     0.887500        88745         8.89
       1.963     0.900000        90008        10.00
       2.009     0.912500        91227        11.43
       2.065     0.925000        92502        13.33
       2.127     0.937500        93755        16.00
       2.159     0.943750        94350        17.78
       2.195     0.950000        94990        20.00
       2.235     0.956250        95602        22.86
       2.279     0.962500        96220        26.67
       2.331     0.968750        96862        32.00
       2.359     0.971875        97166        35.56
       2.389     0.975000        97487        40.00
       2.423     0.978125        97791        45.71
       2.463     0.981250        98093        53.33
       2.513     0.984375        98406        64.00
       2.545     0.985938        98563        71.11
       2.579     0.987500        98722        80.00
       2.623     0.989062        98875        91.43
       2.675     0.990625        99033       106.67
       2.765     0.992188        99187       128.00
       2.849     0.992969        99266       142.22
       3.051     0.993750        99343       160.00
       3.563     0.994531        99421       182.86
       4.663     0.995313        99499       213.33
       6.431     0.996094        99577       256.00
       7.279     0.996484        99616       284.44
       8.303     0.996875        99655       320.00
       9.447     0.997266        99694       365.71
      10.727     0.997656        99733       426.67
      11.935     0.998047        99772       512.00
      12.439     0.998242        99792       568.89
      12.983     0.998437        99811       640.00
      13.535     0.998633        99831       731.43
      14.095     0.998828        99850       853.33
      14.519     0.999023        99870      1024.00
      14.855     0.999121        99880      1137.78
      15.023     0.999219        99889      1280.00
      15.423     0.999316        99899      1462.86
      15.807     0.999414        99909      1706.67
      16.303     0.999512        99919      2048.00
      16.447     0.999561        99924      2275.56
      16.767     0.999609        99928      2560.00
      16.959     0.999658        99933      2925.71
      17.055     0.999707        99938      3413.33
      17.343     0.999756        99943      4096.00
      17.455     0.999780        99946      4551.11
      17.551     0.999805        99948      5120.00
      17.583     0.999829        99950      5851.43
      17.871     0.999854        99953      6826.67
      18.031     0.999878        99955      8192.00
      18.223     0.999890        99957      9102.22
      18.351     0.999902        99958     10240.00
      18.607     0.999915        99959     11702.86
      18.687     0.999927        99960     13653.33
      18.831     0.999939        99961     16384.00
      19.119     0.999945        99962     18204.44
      19.279     0.999951        99963     20480.00
      19.279     0.999957        99963     23405.71
      19.343     0.999963        99964     27306.67
      19.343     0.999969        99964     32768.00
      19.743     0.999973        99965     36408.89
      19.743     0.999976        99965     40960.00
      19.743     0.999979        99965     46811.43
      20.031     0.999982        99966     54613.33
      20.031     0.999985        99966     65536.00
      20.031     0.999986        99966     72817.78
      20.031     0.999988        99966     81920.00
      20.031     0.999989        99966     93622.86
      20.319     0.999991        99967    109226.67
      20.319     1.000000        99967          inf
#[Mean    =        1.266, StdDeviation   =        0.895]
#[Max     =       20.304, Total count    =        99967]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149992 requests in 30.00s, 9.58MB read
Requests/sec:   4999.64
Transfer/sec:    327.12KB

----------------------------------------------------------------------------------------------------------------

STATUS

Running 10s test @ http://localhost:8080/v0/status
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   165.12us   57.15us   2.82ms   90.93%
    Req/Sec    27.01k     2.59k   31.08k    71.29%
  Latency Distribution
     50%  161.00us
     75%  174.00us
     90%  191.00us
     99%  369.00us
  542841 requests in 10.10s, 54.36MB read
Requests/sec:  53748.03
Transfer/sec:      5.38MB